////////////////////////////////////////////////
// © https://github.com/badhitman - @FakeGov 
////////////////////////////////////////////////

namespace SharedLib.CommerceML2;

/// <summary>
/// Позволяет четко структурировать адрес и затем, например, производить отбор сущностей по региону, городу и т.п.
/// </summary>
public partial class АдресноеПоле
{
    /// <summary>
    /// Возможные значения: Почтовый индекс, Страна, Регион, Район, Населенный пункт, Город, Улица, Дом, Корпус, Квартира
    /// </summary>
    public АдресТип Тип { get; set; }

    /// <remarks/>
    public required string Значение { get; set; }
}