namespace SharedLib.CommerceML2;

/// <summary>
/// Определяет роль участника обмена
/// </summary>
public enum РольТип
{
    /// <remarks/>
    Продавец,

    /// <remarks/>
    Покупатель,

    /// <remarks/>
    Плательщик,

    /// <remarks/>
    Получатель,

    /// <remarks/>
    Комитент,

    /// <remarks/>
    Комиссионер,

    /// <remarks/>
    Лицензиар,

    /// <remarks/>
    Лицензиат,
}
#pragma warning restore CS8618 // Поле, не допускающее значения NULL, должно содержать значение, отличное от NULL, при выходе из конструктора. Рассмотрите возможность добавления модификатора "required" или объявления значения, допускающего значение NULL.